import { Helmet } from "react-helmet-async";
const Blog = () => {
  return (
    <> 
    <Helmet>
      <title>dipngkar | blog</title>
    </Helmet>
      <div className="join join-vertical w-full mt-12">
        <div className="collapse collapse-arrow join-item border border-base-300">
          <input type="radio" name="my-accordion-4" checked="checked" />
          <div className="collapse-title text-2xl font-medium text-white">
            <h2>আমি একজন ওয়েব ডেভলপার হতে চাই? কিভাবে শুরু করতে পারি?</h2>
          </div>
          <div className="collapse-content text-emerald-50">
            <p className="mt-2">ওয়েব ডেভেলপমেন্ট শেখার পাঁচটা সিস্টেম আছে। </p>
            <p className="mt-3">
              {" "}
              ১. ওয়েব ডেভেলপমেন্ট শেখার বেস্ট জায়গা হচ্ছে freecodecamp . org ।
              তাদের মতো করে অর্গানাইজড রিসোর্চ খুব কম আছে। সেখানে গিয়ে একাউন্ট
              খুলে ৬ মাস সময় নিয়ে সিরিয়াল ধরে ধরে শিখতে থাকো। প্রাকটিস করতে
              থাকো। শুরুতেই করবে Responsive Web Design সেখানে সুন্দর এবং সহজ
              একটা কোড এডিটর আছে। আগের চাইতে নতুন কিছু সিস্টেম নিয়ে আসছে।
              প্রজেক্ট দিয়ে সাজিয়েছে পুরা স্টেপ বাই স্টেপ গাইডলাইন আছে। কারো
              হাতে সময় এবং ধৈর্য্য থাকলে এইটা শুরু করে দিতে পারো। সেখানে
              Responsive Web Design শেষ করার পর JavaScript Algorithms and Data
              Structures শেষ করবে। হয়তো প্রথমবার ভালো বুঝবে না। দরকার হলে যে যে
              অংশ ভালো বুঝতে পারতেছো না। সেগুলা মার্ক করে রাখো। এবং একবার শেষ
              করার পর সেগুলা আবার ধরে ধরে দেখবে। যদিও freecodecamp এর ওয়েবসাইট এ
              আরো অনেক জিনিস আছে। সবকিছু ই ভালো। তবে সব দিকে ঠুসা মারতে যেও না।
              কোনটাতেই লাভ হবে না। জাস্ট সিম্পলভাবে যে দুইটা বলতেছেই সেই দুটা
              করো। তারপর Front End Development Libraries এর মধ্যে পারলে সব না
              পারলে bootstrap, react, redux করতে পারো। মাঝে মধ্যে দুই একজনকে
              শুনি theodinproject . com কে রিকমেন্ড করতে। তবে আমি ব্যক্তিগতভাবে
              এখনো oidin কে freecodecamp এর ধারেপাশে মনে করি না।
            </p>
            <p className="mt-3">
              ২. যদি ছোট ছোট অংশ করে শিখতে চাও। তাহলে সিম্পল এর গর্জিয়াস হচ্ছে
              w3schools . com সেখানে গিয়ে হোমপেইজেই দেখবে। সেখানে এখন যদিও পেইড
              ভিডিও সিরিজ আনছে তারপরেও ধৈর্য্য ধরে ধরে টেক্সট ধরে ধরে শিখতে শুরু
              করে দাও। জাস্ট Learn HTML এ ক্লিক করে সবার আগে রাখছে HTML জাস্ট
              সিরিয়াল ধরে শিখতে থাকো। প্রথমেই দেখবে শখানেক HTML ট্যাগ। একটার পর
              একটা আসবে। কিছু বুঝবে কিছু বুঝবে না। কিছু মনে থাকবে আর কিছু মনে
              থাকবে না। কিছু রিপিট হবে আর কিছু দুই একবার দেখবে। তারপরেই দেখতে
              থাকো। এবং লাস্টে একটা জায়গায় HTML Tag list নামে একটা লিংক দেখবে।
              এইটাই তোমার ব্রেইন। কারণ কোন কিছু মনে না থাকলে এই পেইজে গিয়ে সার্চ
              দিবে আর জেনে ফেলবে। মুখস্ত করার একদমই দরকার পড়বে না। একই সিস্টেমে
              CSS এর জন্য প্রচুর সময় দিবে। প্রচুর মানে প্রচুর। হিসবারের বাইরে।
              তারপর ধরে ধরে CSS এর স্টাইলগুলো শিখবে। শিখতে শিখতে এক সময় সিস
              Reference দেখতে পাবে। সেটাই তোমার CSS এর নলেজ ভান্ডার। ভুলে গেলে
              হয় গুগলে সার্চ দিবে না হয় এই লিংকে গিয়ে টুপুস করে দেখে ফেলবে। সেইম
              রুল এ তুমি w3 স্কুল এর ওয়েবসাইট এ গিয়ে Learn JavaScript সিরিয়াল
              ধরে শিখবে। প্রোগ্রামিং ল্যাংগুয়েজ এর বেসিক শিখবে। কিছু উদারহণ
              শিখবে। ভিতরে অনেক জিনিস আছে। Array function Object শিখবে। DOM,
              API, Browser এর ভিতরে কি কি আছে সেগুলা শিখবে। সময় অনেক অনেক বেশি
              লাগবে। এই কয়টা জিনিস শিখতেই তোমার ৫-৬ মাস বা তারও বেশি লেগে যাবে।
              তবে শেখা অনেক বেশি পোক্ত হবে।{" "}
            </p>
            <p className="mt3">
              ৩. ইদানিংকালে শুরু করার সবচেয়ে ভালো জায়গা হচ্ছে ইউটিউব। আর ইউটিউব
              থেকে যদি বাংলায় কিছু শিখতে চাও তাহলে আনিসুল ইসলাম এর চ্যানেল এর
              চাইতে কোয়ালিটি এবং অর্গানাইজড এবং এতো ডিটেইলড কনটেন্ট আর কোথাও
              আমার চোখে পড়ে নাই। জাস্ট Anisul Islam এর চ্যানেল এ গিয়ে প্লেলিস্ট
              এ গিয়ে হালকা স্ক্রল করে দেখলে Full-stack Web development in Bangla
              পাবে। সেখানে সিরিয়াল ধরে HTML এর উপরে ৪০ টা ভিডিও, CSS এর উপরে ৮১
              টা ভিডিও Git, বুটস্ট্রাপ, জাভাস্ক্রিপ্ট উপরে ১০১ টা ভিডিও আছে। আর
              জাভাস্ক্রিপ্ট আরেকটু ভালোভাবে শিখতে চাইলে Learn with Sumit - LWS -
              Bangladesh এর কনটেন্ট অনেক বেশি গুছানো। সেখানে তিনটা প্লেলিস্ট
              আছে। JavaScript Bangla Tutorial তারপর modern javascript es6 bangla
              tutorial এবং এরপর javascript tips and tricks দেখবে। এরপরে আমার
              পছন্দ Stack Learner ওয়েব ডিজাইন মাস্টার ক্লাস প্লেলিস্ট। খুবই
              বিস্তারিত একটা প্লেলিষ্ট। এছাড়াও স্ট্যাক লার্নার এর চ্যানেলে আরো
              অনেক অনেক প্লেলিস্ট আছে সেগুলা যত খুঁটিয়ে খুঁটিয়ে দেখবে। প্রাকটিস
              করবে তত ভালো। ------------{" "}
            </p>
          </div>
        </div>
        <div className="collapse collapse-arrow join-item border border-base-300">
          <input type="radio" name="my-accordion-4" />
          <div className="collapse-title text-2xl font-medium text-white">
            <h2>অনেকের মনে প্রশ্ন ওয়েব ডেভেলপমেন্ট এর ফিউচার কী</h2>
          </div>
          <div className="collapse-content text-emerald-50">
            <p className="mt-4">
              সত্যি বলতে Web Developer রা শক্তিশালী চাকরির বাজারের সুবিধা নিতে
              পারে। প্রজেকশনস সেন্ট্রাল অনুসারে, 46টি রাজ্য এবং মার্কিন অঞ্চলে
              2018-2028 এর মধ্যে ওয়েব ডেভেলপারের চাকরি কমপক্ষে 5% এর বেশি
              বৃদ্ধি পাচ্ছে।
            </p>

            <p className="mt-4">
              ওয়েব ডেভেলপমেন্ট ফিল্ড থেকে ক্যারিয়ারের অন্যদিকে ও সুইচ করা যায়।
              প্রাসঙ্গিক ডিগ্রি বা অভিজ্ঞতা সহ পেশাদাররা সিনিয়র ওয়েব ডেভেলপার
              বা সফ্টওয়্যার ইঞ্জিনিয়ার হিসাবে চাকরিতে অগ্রসর হতে পারেন। এছাড়া
              টেক লিড, প্রোডাক্ট ম্যানেজার হিসেবে ও ক্যারিয়ার সাজাতে পারা যায়
              ফিউচারে
            </p>

            <p className="mt-4">
              AI, ভয়েস সার্চ, ব্লকচেইন, এবং IoT দিনদিন জনপ্রইয় হচ্ছে এবং এসব
              জায়গাতে ওয়েব বেজড সার্ভিস প্রায়োরিটি পাচ্ছে। সুতরান এসব জায়গাতে ও
              প্রচুর ওয়েব ডেভেলপার দরকার হচ্ছে সামনেও হবে।
            </p>

            <li>
              2024 সালের মধ্যে ওয়েব ডেভেলপমেন্ট ক্ষেত্রটি 27 শতাংশ বৃদ্ধি পাবে
              বলে আশা করা হচ্ছে।
            </li>

            <p className="mt-4">
              তাই এত তাড়াতাড়ি এর ফিউচার নষ্ট হচ্ছেনা সেটা নিশ্চিত।যদি আপনি কোডিং
              ভালো পারেন তাহলে এর চাহিদা কখনো শেষ হবেনা।
            </p>

            <p className="mt-3">
              ওয়েব ডেভেলপমেন্টকে যদি ভালো কোড করার দিক থেকে সংজ্ঞায়িত করেন,
              তাহলে না, ওয়েব ডেভেলপার রা কোথাও যাচ্ছেন না। তাদের জন্য চাহিদা
              সবসময় থাকবে কারণ প্রযুক্তি যত দ্রুত পরিবর্তিত হোক না কেন, মানুষের
              সর্বদা এমন একজনের প্রয়োজন হবে যিনি তাদের ওয়েবসাইট বা অ্যাপ তৈরি
              করতে সাহায্য করার জন্য সর্বশেষ কোড এবং ডিজাইন ডেভেলপমেন্ট এর সাথে
              তাল মিলিয়ে চলতে পারেন।
            </p>

            <p className="mt-3">
              পাশাপাশি যদি ওয়েব এর লেটেস্ট টেকনোলজির দিকে আসা হয় আমরা দেখি
              বর্তমানে ইউজার ইন্টারফেস ডেভেলপ করার জন্য সবচেয়ে বেশি যে
              ফ্রেমওয়ার্ক ইউজ করা হয়, সেটি হলো রিয়েক্ট। এমনকি, ফেসবুকের বর্তমান
              UI রিয়েক্ট দিয়েই তৈরি করা। বিশ্বে এই মূহুর্তে সবচেয়ে চাকরি যে
              ফ্রেমওয়ার্কের জন্য, সেটাও এই রিয়েক্ট।
            </p>

            <p className="mt-4">
              React Node ফোকাস করে কেউ যদি ফুলস্ট্যাক ডেভেলপার হতে চায় তাহলে
              MERN Stack ডেভেলপমেন্টের ব্যাপারে ভাবতে পারে। ফ্রন্টএন্ড-এ রিয়েক্ট
              এবং ব্যাকেন্ডে NodeJs, MongoDB, ExpressJs - এটাই হলো MERN Stack.
              web . programming-hero . com এখানে গেলে ও কী কী শেখা প্রয়োজন তার
              একটা লিস্ট পেয়ে যাবেন।
            </p>

            <p className="mt-4">
              বাংলাদেশী প্রেক্ষাপটে একজন জুনিয়র রিয়েক্ট বা মার্ন স্ট্যাক
              ডেভেলপারের স্টার্টিং-এ স্যালারী হয় এভারেজে ২০ থেকে ২৫ হাজার৷
              কোম্পানির ওপর পরিমাণটা ভ্যারি করে।দুই বছর কাজ করার অভিজ্ঞতা থাকলে
              স্যালারীর পরিমাণ দ্বিগুণ কিংবা তারও বেশিতে গিয়ে দাঁড়ায়। নির্ভর
              করে - স্কিলের ওপর। টেকনোলজির এই ফিল্ডে স্কিলই একমাত্র পরিচয়।
              করোনার মহামারির কথা চিন্তা করা যায়, লক্ষ লক্ষ মানুষ চাকরিহারা হলেও
              টেকনোলজির সাথে জড়িত থাকা মানুষগুলোকে এমন পরস্থিতিতে পড়তে হয়নি।
              বরং, এই সময়ে চাহিদা আরো বহুগুণ বেড়েছে। আপনি যদি এখনো দ্বিধায়
              থাকেন, ওয়েব ডেভেলপার হিশেবে ক্যারিয়ার গড়া সঠিক সিদ্ধান্ত হবে কিনা,
              নিঃসন্দেহে ওয়েব ডেভেলপমেন্টের ক্যারিয়ারের ব্যাপারে সিরিয়াসলি ভাবতে
              পারেন।
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default Blog;
